Revit 2024 API
SubTransaction Class
 Sub-transactions are objects that provide control over a subset of changes in a document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public class SubTransaction : IDisposable
Visual Basic
Public Class SubTransaction _
	Implements IDisposable
Visual C++
public ref class SubTransaction : IDisposable
Remarks
 A Sub-transaction can only be active as a part of an open transaction. Sub-transactions may be nested inside each other, but with the restriction that every nested sub-transaction is entirely contained (opened and closed) in the parent sub-transaction.
If a sub-transaction was started and not committed or rolled back by the time the SubTransaction object is about to be disposed, the destructor will roll back the sub-transaction automatically, thus all changes made to the document during the sub-transaction will be discarded. It is not recommended to rely on this default behavior though. Instead, it is advised to always call either Commit or RollBack explicitly before the sub-transaction object gets disposed. Please note that unless invoked explicitly the actual destruction of an object in managed code might not happen until the object is collected by the garbage collector.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.SubTransaction
See Also
SubTransaction Members
Autodesk.Revit.DB Namespace